### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # azurerm_private_dns_resolver.com will be created
  + resource "azurerm_private_dns_resolver" "com" {
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "io-p-itn-com-dnspr-01"
      + resource_group_name = "io-p-itn-com-rg-01"
      + tags                = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
      + virtual_network_id  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01"
    }

  # azurerm_private_dns_resolver_dns_forwarding_ruleset.com will be created
  + resource "azurerm_private_dns_resolver_dns_forwarding_ruleset" "com" {
      + id                                         = (known after apply)
      + location                                   = "italynorth"
      + name                                       = "io-p-itn-com-dnsfrs-01"
      + private_dns_resolver_outbound_endpoint_ids = (known after apply)
      + resource_group_name                        = "io-p-itn-common-rg-01"
      + tags                                       = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
    }

  # azurerm_private_dns_resolver_outbound_endpoint.com will be created
  + resource "azurerm_private_dns_resolver_outbound_endpoint" "com" {
      + id                      = (known after apply)
      + location                = "italynorth"
      + name                    = "io-p-itn-com-out-01"
      + private_dns_resolver_id = (known after apply)
      + subnet_id               = (known after apply)
      + tags                    = {
          + "BusinessUnit"   = "App IO"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Prod"
          + "ManagementTeam" = "IO Comunicazione"
          + "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
    }

  # azurerm_private_endpoint.pagopa_core_evhns will be destroyed
  # (because azurerm_private_endpoint.pagopa_core_evhns is not in configuration)
  - resource "azurerm_private_endpoint" "pagopa_core_evhns" {
      - custom_dns_configs            = [] -> null
      - id                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-com-pagopa-core-evhns-evhns-pep-01" -> null
      - location                      = "italynorth" -> null
      - name                          = "io-p-itn-com-pagopa-core-evhns-evhns-pep-01" -> null
      - network_interface             = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-com-pagopa-core-evhns-evhns-pep-01.nic.d008a300-fd48-45c6-990d-7168a3602ac0"
              - name = "io-p-itn-com-pagopa-core-evhns-evhns-pep-01.nic.d008a300-fd48-45c6-990d-7168a3602ac0"
            },
        ] -> null
      - private_dns_zone_configs      = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-com-pagopa-core-evhns-evhns-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.servicebus.windows.net"
              - name                = "privatelink.servicebus.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-evt-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net"
              - record_sets         = []
            },
        ] -> null
      - resource_group_name           = "io-p-itn-com-rg-01" -> null
      - subnet_id                     = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-pep-snet-01" -> null
      - tags                          = {
          - "BusinessUnit"   = "App IO"
          - "CostCenter"     = "TS000 - Tecnologia e Servizi"
          - "CreatedBy"      = "Terraform"
          - "Environment"    = "Prod"
          - "ManagementTeam" = "IO Comunicazione"
          - "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        } -> null
        # (1 unchanged attribute hidden)

      - private_dns_zone_group {
          - id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-com-pagopa-core-evhns-evhns-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> null
          - name                 = "private-dns-zone-group" -> null
          - private_dns_zone_ids = [
              - "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-evt-rg/providers/Microsoft.Network/privateDnsZones/privatelink.servicebus.windows.net",
            ] -> null
        }

      - private_service_connection {
          - is_manual_connection              = true -> null
          - name                              = "io-p-itn-com-pagopa-core-evhns-evhns-pep-01" -> null
          - private_connection_resource_id    = "/subscriptions/b9fc9419-6097-45fe-9f74-ba0641c91912/resourceGroups/pagopa-p-msg-rg/providers/Microsoft.EventHub/namespaces/pagopa-p-weu-core-evh-ns03" -> null
          - private_ip_address                = "10.20.2.26" -> null
          - request_message                   = "Payment Updater service" -> null
          - subresource_names                 = [
              - "namespace",
            ] -> null
            # (1 unchanged attribute hidden)
        }
    }

  # azurerm_subnet.dns_resolver will be created
  + resource "azurerm_subnet" "dns_resolver" {
      + address_prefixes                              = [
          + "10.20.4.112/28",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "io-p-itn-dnspr-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "io-p-itn-com-rg-01"
      + virtual_network_name                          = "io-p-itn-common-vnet-01"

      + delegation {
          + name = "Microsoft.Network/dnsResolvers"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/join/action",
                ]
              + name    = "Microsoft.Network/dnsResolvers"
            }
        }
    }

  # module.container_apps.azurerm_private_dns_resolver_forwarding_rule.pagopa-core-evhns will be created
  + resource "azurerm_private_dns_resolver_forwarding_rule" "pagopa-core-evhns" {
      + dns_forwarding_ruleset_id = (known after apply)
      + domain_name               = "pagopa-p-weu-core-evh-ns03.servicebus.windows.net."
      + enabled                   = true
      + id                        = (known after apply)
      + name                      = "pagopa-core-evhns"

      + target_dns_servers {
          + ip_address = "208.67.222.222"
          + port       = 53
        }
    }

  # module.web_apps.module.cqrs_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
      ~ app_settings                                   = {
          - "AzureWebJobs.CosmosApiMessageStatusChangeFeedForReminder.Disabled"                                = "0" -> null
          - "AzureWebJobs.CosmosApiMessagesChangeFeed.Disabled"                                                = "0" -> null
          - "AzureWebJobs.CosmosRemoteContentMessageConfigurationChangeFeed.Disabled"                          = "1" -> null
          - "AzureWebJobs.HandleMessageChangeFeedPublishFailures.Disabled"                                     = "0" -> null
            # (31 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-cqrs-func-01"
        name                                           = "io-p-itn-com-cqrs-func-01"
        tags                                           = {
            "BusinessUnit"                           = "App IO"
            "CostCenter"                             = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                              = "Terraform"
            "Environment"                            = "Prod"
            "ManagementTeam"                         = "IO Comunicazione"
            "ModuleName"                             = "azure_function_app"
            "ModuleSource"                           = "DX"
            "ModuleVersion"                          = "1.0.1"
            "Source"                                 = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-resource-id" = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (33 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.web_apps.module.cqrs_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          + "AzureWebJobs.CosmosApiMessageStatusChangeFeedForReminder.Disabled"                                = "1"
          + "AzureWebJobs.CosmosApiMessagesChangeFeed.Disabled"                                                = "1"
          + "AzureWebJobs.CosmosRemoteContentMessageConfigurationChangeFeed.Disabled"                          = "1"
          + "AzureWebJobs.HandleMessageChangeFeedPublishFailures.Disabled"                                     = "1"
            # (32 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-cqrs-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"                                   = "App IO"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Comunicazione"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "1.0.1"
            "Source"                                         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
            "hidden-link: /app-insights-conn-string"         = "InstrumentationKey=ab45103a-cb4f-474b-933f-d802ed1082d5;IngestionEndpoint=https://westeurope-3.in.applicationinsights.azure.com/;LiveEndpoint=https://westeurope.livediagnostics.monitor.azure.com/;ApplicationId=2a5ffa17-99f9-4d9b-a253-18dba6759d94"
            "hidden-link: /app-insights-instrumentation-key" = "ab45103a-cb4f-474b-933f-d802ed1082d5"
            "hidden-link: /app-insights-resource-id"         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/microsoft.insights/components/io-p-ai-common"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 5 to add, 2 to change, 1 to destroy.
```

</details>
